import Image1 from "./images/image1.jpg";
import Image2 from "./images/image2.jpg";
import Image3 from "./images/image3.jpg";
import Image4 from "./images/image4.jpg";
import Image5 from "./images/image5.jpg";
import Image6 from "./images/image6.jpg";
import Image7 from "./images/image7.jpg";
import Image8 from "./images/image8.jpg";
import Image9 from "./images/image9.jpg";
import Image10 from "./images/image10.jpg";

const structures = [
  {
    img: Image1,
    title: "Носферату",
    description: [
      `Носферату — фильм, основанный на романе Эдгара Уильямса Уотсона "Носферату" (1897). 
            Фильм был снят в 1922 году и является одним из первых фильмов, в которых использовались эффекты тени.`,
      `Фильм был снят в 1922 году и является одним из первых фильмов, в которых использовались эффекты тени.`,
    ],
  },
  {
    img: Image2,
    title: "Эмилия Перез",
    description: [
      `«Эми́лия Пе́рес» — французский криминально-комедийный мюзикл 2024 года режиссёра Жака Одиара,
       снятый по его же собственному сценарию. Главные роли исполнили Карла София Гаскон, Зои Салдана,
        Селена Гомес, Адриана Пас и Эдгар Рамирес.`,
    ],
  },
  {
    img: Image3,
    title: "Бруталист",
    description: [
      `"Бруталист" - фильм 2024 года, снятый и спродюсированный Брэди Корбетом,
       повествует о венгерском архитекторе Ласло Тоте, пережившем Холокост и иммигрировавшем в США.
        Фильм представляет собой эпическую историческую драму, в которой главный герой борется за достижение
        "американской мечты" в новом для себя мире`,
    ],
  },
  {
    img: Image4,
    title: "Шоу субботним вечером",
    description: [
      `"Шоу субботним вечером" (англ. Saturday Night) - это драматическая комедия, снятая режиссером Джейсоном Райтманом,
       которая повествует о полутора часах, предшествовавших первому эфиру культового телешоу
        "Субботним вечером в прямом эфире" (SNL) в 1975 году. Фильм показывает хаос, творческий процесс,
         и борьбу за успех, которые происходили за кулисами накануне премьеры`,
    ],
  },
  {
    img: Image5,
    title: "Субстанция",
    description: [
      `«Субстанция» — это боди-хоррор о звезде Элизабет Спаркл, чья карьера идёт на спад. В попытке вернуть себе молодость
       и актуальность в Голливуде, она принимает экспериментальную субстанцию, которая создает ее более молодую и 
       привлекательную версию, Сью. Однако, появление Сью приводит к неожиданным и часто мрачным последствиям, 
       раскрывая внутренний конфликт Элизабет и её нарциссические черты`,
    ],
  },
  {
    img: Image6,
    title: "Лэндмен",
    description: [
      `"Лэндмен" - это американская драматическая телесериал от Тейлора Шеридана, основанный на подкасте "Бумтаун" 
      Кристиана Уоллеса. Действие происходит в Западном Техасе, где главный герой Томми Норрис, управляющий нефтяными 
      месторождениями, сталкивается с различными проблемами: от конфликтов с криминалом и властями 
      до взаимоотношений с семьей, включая сына Купера и бывшую жену`,
    ],
  },
  {
    img: Image7,
    title: "Гладиатор 2",
    description: [
      `Гладиатор 2 - это американский драматический фильм, снятый режиссёром Джоном Фавро. 
      Фильм продолжает историю главного героя Тициуса, который продолжает бороться с врагами, 
      включая его бывшую жену и брат, а также бороться с внутренним конфликтом`,
    ],
  },
  {
    img: Image8,
    title: "Плохая девочка",
    description: [
      `Роми, глава крупной компании, привыкшая управлять людьми, становится игрушкой молодого интерна Сэмюэла.
       Правила просты: она подчиняется всем его приказам, а он хранит ее тайну. Но вырвавшаяся за пределы офиса страсть
        грозит уничтожить их обоих.`,
    ],
  },
  {
    img: Image9,
    title: "Большой потенциал",
    description: [
      `«Большой потенциал» — драматический телесериал, созданный Дрю Годдардом для ABC. Американская адаптация французского
       телесериала HPI. Премьера сериала состоялась 17 сентября 2024 года.`,
    ],
  },
  {
    img: Image10,
    title: "Анора",
    description: [
      `«Ано́ра» — комедийно-драматический фильм 2024 года американского режиссёра и сценариста Шона Бейкера.
       По сюжету молодая секс-работница Анора выходит замуж за Ивана Захарова, сына российского олигарха. 
       Узнав об этом, родители Ивана готовы пойти на всё, чтобы аннулировать брак`,
    ],
  },
];

export default structures;
